xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_LEN (1u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_OFF (19u)

/** \brief Length for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_INTCHAIN_LEN (4u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_INTCHAIN_MSK (0xfu)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_ATOM_TRIG_INTCHAIN_OFF (20u)

/** \brief Length for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_INTCHAIN_LEN (5u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_INTCHAIN_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_INTCHAIN_OFF (24u)

/** \brief Length for Ifx_GTM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_HW_CONF_INT_CLK_EN_GEN_LEN (1u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_HW_CONF_INT_CLK_EN_GEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_HW_CONF_INT_CLK_EN_GEN_OFF (29u)

/** \brief Length for Ifx_GTM_CFG_Bits.SRC_IN_MUX */
#define IFX_GTM_CFG_SRC_IN_MUX_LEN (1u)

/** \brief Mask for Ifx_GTM_CFG_Bits.SRC_IN_MUX */
#define IFX_GTM_CFG_SRC_IN_MUX_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CFG_Bits.SRC_IN_MUX */
#define IFX_GTM_CFG_SRC_IN_MUX_OFF (0u)

/** \brief Length for Ifx_GTM_AEI_STA_XPT_Bits.ADDR */
#define IFX_GTM_AEI_STA_XPT_ADDR_LEN (20u)

/** \brief Mask for Ifx_GTM_AEI_STA_XPT_Bits.ADDR */
#define IFX_GTM_AEI_STA_XPT_ADDR_MSK (0xfffffu)

/** \brief Offset for Ifx_GTM_AEI_STA_XPT_Bits.ADDR */
#define IFX_GTM_AEI_STA_XPT_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_AEI_STA_XPT_Bits.W1R0 */
#define IFX_GTM_AEI_STA_XPT_W1R0_LEN (1u)

/** \brief Mask for Ifx_GTM_AEI_STA_XPT_Bits.W1R0 */
#define IFX_GTM_AEI_STA_XPT_W1R0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AEI_STA_XPT_Bits.W1R0 */
#define IFX_GTM_AEI_STA_XPT_W1R0_OFF (20u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_OFF (1u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.BYPASS_SYNC */
#define IFX_GTM_BRIDGE_MODE_BYPASS_SYNC_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.BYPASS_SYNC */
#define IFX_GTM_BRIDGE_MODE_BYPASS_SYNC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.BYPASS_SYNC */
#define IFX_GTM_BRIDGE_MODE_BYPASS_SYNC_OFF (2u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_OFF (8u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_OFF (9u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_OFF (12u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_OFF (16u)

/** \brief Length for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_LEN (8u)

/** \brief Mask for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_MSK (0xffu)

/** \brief Offset for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_OFF (24u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_LEN (5u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_OFF (0u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_LEN (5u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_OFF (5u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_LEN (5u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_BRIDGE_PTR1_Bits.TRAN_IN_PGR */
#define IFX_GTM_BRIDGE_PTR1_TRAN_IN_PGR_OFF (10u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_LEN (5u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_MSK (0x1fu)

