xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH1_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH2_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH3_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH4_EIRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH5_EIRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH6_EIRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH7_EIRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH0_EIRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH1_EIRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH2_EIRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH3_EIRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH4_EIRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH5_EIRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH6_EIRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH7_EIRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH0_EIRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH1_EIRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH2_EIRQ_OFF (18u)

