xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M1_EIRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M1_EIRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M2_EIRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M2_EIRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_MCS_Bits.MCS_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_MCS_MCS_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_PSM_Bits.PSM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_PSM_PSM_M0_CH5_IRQ_LEN (1u)

