xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DPLL_ADT_TI_Bits.PD */
#define IFX_GTM_DPLL_ADT_TI_PD_MSK (0x1fffu)

/** \brief Offset for Ifx_GTM_DPLL_ADT_TI_Bits.PD */
#define IFX_GTM_DPLL_ADT_TI_PD_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADT_TI_Bits.TINT */
#define IFX_GTM_DPLL_ADT_TI_TINT_LEN (3u)

/** \brief Mask for Ifx_GTM_DPLL_ADT_TI_Bits.TINT */
#define IFX_GTM_DPLL_ADT_TI_TINT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_DPLL_ADT_TI_Bits.TINT */
#define IFX_GTM_DPLL_ADT_TI_TINT_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_ADT_TI_Bits.NT */
#define IFX_GTM_DPLL_ADT_TI_NT_LEN (3u)

/** \brief Mask for Ifx_GTM_DPLL_ADT_TI_Bits.NT */
#define IFX_GTM_DPLL_ADT_TI_NT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_DPLL_ADT_TI_Bits.NT */
#define IFX_GTM_DPLL_ADT_TI_NT_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_DT_TI_Bits.DT_T */
#define IFX_GTM_DPLL_DT_TI_DT_T_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_DT_TI_Bits.DT_T */
#define IFX_GTM_DPLL_DT_TI_DT_T_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_DT_TI_Bits.DT_T */
#define IFX_GTM_DPLL_DT_TI_DT_T_OFF (0u)

/** \brief Length for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CLC_Bits.DISR */
#define IFX_GTM_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CLC_Bits.DISS */
#define IFX_GTM_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CLC_Bits.EDIS */
#define IFX_GTM_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_GTM_RESET_CLR_Bits.CLR */
#define IFX_GTM_RESET_CLR_CLR_LEN (1u)

/** \brief Mask for Ifx_GTM_RESET_CLR_Bits.CLR */
#define IFX_GTM_RESET_CLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_RESET_CLR_Bits.CLR */
#define IFX_GTM_RESET_CLR_CLR_OFF (0u)

/** \brief Length for Ifx_GTM_RESET1_Bits.RST */
#define IFX_GTM_RESET1_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_RESET1_Bits.RST */
#define IFX_GTM_RESET1_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_RESET1_Bits.RST */
#define IFX_GTM_RESET1_RST_OFF (0u)

/** \brief Length for Ifx_GTM_RESET1_Bits.RSTSTAT */
#define IFX_GTM_RESET1_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_GTM_RESET1_Bits.RSTSTAT */
#define IFX_GTM_RESET1_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_RESET1_Bits.RSTSTAT */
#define IFX_GTM_RESET1_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_GTM_RESET2_Bits.RST */
#define IFX_GTM_RESET2_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_RESET2_Bits.RST */
#define IFX_GTM_RESET2_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_RESET2_Bits.RST */
#define IFX_GTM_RESET2_RST_OFF (0u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN0 */
#define IFX_GTM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN0 */
#define IFX_GTM_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN0 */
#define IFX_GTM_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN1 */
#define IFX_GTM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN1 */
#define IFX_GTM_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN1 */
#define IFX_GTM_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN2 */
#define IFX_GTM_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN2 */
#define IFX_GTM_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN2 */
#define IFX_GTM_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN3 */
#define IFX_GTM_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN3 */
#define IFX_GTM_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN3 */
#define IFX_GTM_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN4 */
#define IFX_GTM_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN4 */
#define IFX_GTM_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN4 */
#define IFX_GTM_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN5 */
#define IFX_GTM_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN5 */
#define IFX_GTM_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN5 */
#define IFX_GTM_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN6 */
#define IFX_GTM_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN6 */
#define IFX_GTM_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN6 */
#define IFX_GTM_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN7 */
#define IFX_GTM_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN7 */
#define IFX_GTM_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN7 */
#define IFX_GTM_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN8 */
#define IFX_GTM_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN8 */
#define IFX_GTM_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN8 */
#define IFX_GTM_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN9 */
#define IFX_GTM_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN9 */
#define IFX_GTM_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN9 */
#define IFX_GTM_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN10 */
#define IFX_GTM_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN10 */
#define IFX_GTM_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN10 */
#define IFX_GTM_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN11 */
#define IFX_GTM_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN11 */
#define IFX_GTM_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN11 */
#define IFX_GTM_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN12 */
#define IFX_GTM_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN12 */
#define IFX_GTM_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN12 */
#define IFX_GTM_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_GTM_ACCEN0_Bits.EN13 */
#define IFX_GTM_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_GTM_ACCEN0_Bits.EN13 */
#define IFX_GTM_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ACCEN0_Bits.EN13 */
#define IFX_GTM_ACCEN0_EN13_OFF (13u)

