xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG1 */
#define IFX_GTM_TRIGOUT_TRIG1_OFF (2u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG2 */
#define IFX_GTM_TRIGOUT_TRIG2_OFF (4u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG3 */
#define IFX_GTM_TRIGOUT_TRIG3_OFF (6u)

/** \brief Length for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_LEN (2u)

/** \brief Mask for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_OFF (0u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_OFF (2u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_OFF (2u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_OFF (0u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_OFF (1u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_OFF (2u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_OFF (16u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_OFF (17u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_OFF (18u)

/** \brief Length for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_LEN (32u)

/** \brief Mask for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_OFF (16u)

