xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL8 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL8_OFF (16u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL9 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL9_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL9 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL9_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL9 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL9_OFF (18u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL10 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL10_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL10 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL10_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL10 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL10_OFF (20u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL11 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL11_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL11 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL11_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL11 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL11_OFF (22u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL12 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL12_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL12 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL12_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL12 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL12_OFF (24u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL13 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL13_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL13 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL13_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL13 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL13_OFF (26u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL14 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL14_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL14 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL14_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL14 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL14_OFF (28u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL15 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL15_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL15 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL15_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INLCON_Bits.SEL15 */
#define IFX_GTM_MSC_MSCQ_INLCON_SEL15_OFF (30u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL0 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL0_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL0 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL0 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL1 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL1_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL1 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL1 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL1_OFF (2u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL2 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL2_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL2 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL2 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL2_OFF (4u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL3 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL3_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL3 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL3 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL3_OFF (6u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL4 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL4_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL4 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL4 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL4_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL5 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL5_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL5 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL5 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL5_OFF (10u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL6 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL6_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL6 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL6 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL6_OFF (12u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL7 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL7_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL7 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL7 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL7_OFF (14u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL8 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL8_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL8 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL8_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL8 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL8_OFF (16u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL9 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL9_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL9 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL9_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL9 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL9_OFF (18u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL10 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL10_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL10 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL10_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL10 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL10_OFF (20u)

/** \brief Length for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL11 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL11_LEN (2u)

/** \brief Mask for Ifx_GTM_MSC_MSCQ_INHCON_Bits.SEL11 */
#define IFX_GTM_MSC_MSCQ_INHCON_SEL11_MSK (0x3u)

