xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_OFF (18u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_SINGLE_PULSE_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_SINGLE_PULSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_SINGLE_PULSE_OFF (19u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_INTCHAIN_LEN (4u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_INTCHAIN_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_INTCHAIN_OFF (20u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_TOM_TRIG_INTCHAIN_LEN (5u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_TOM_TRIG_INTCHAIN_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.TOM_TRIG_INTCHAIN */
#define IFX_GTM_CCM_HW_CONF_TOM_TRIG_INTCHAIN_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM_HW_CONF_INT_CLK_EN_GEN_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM_HW_CONF_INT_CLK_EN_GEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.INT_CLK_EN_GEN */
#define IFX_GTM_CCM_HW_CONF_INT_CLK_EN_GEN_OFF (29u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH0_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH0_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH1_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH1_OFF (1u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH2_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH2_OFF (2u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH3_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH3_OFF (3u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH4_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH4_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH5_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH5_OFF (5u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH6_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH6_OFF (6u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH7_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SRC_CH7_OFF (7u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH0_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH0 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH0_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH1_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH1 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH1_OFF (17u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH2_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH2 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH2_OFF (18u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH3 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH3_OFF (19u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH4 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH4_OFF (20u)

/** \brief Length for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_TIM_AUX_IN_SRC_Bits.SEL_OUT_N_CH5 */
#define IFX_GTM_CCM_TIM_AUX_IN_SRC_SEL_OUT_N_CH5_OFF (21u)

