xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_2_OFF (19u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CII3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CII3_OFF (24u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.CIS3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_CIS3_OFF (25u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL0_3_OFF (26u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL3_Bits.TSEL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL3_TSEL1_3_OFF (27u)

/** \brief Length for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR0 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR0_LEN (9u)

/** \brief Mask for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR0 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR0_MSK (0x1ffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR0 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR0_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR1 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR1_LEN (9u)

/** \brief Mask for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR1 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR1_MSK (0x1ffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_RDADDR_Bits.RDADDR1 */
#define IFX_GTM_ATOM_CH_RDADDR_RDADDR1_OFF (16u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.MODE */
#define IFX_GTM_ATOM_CH_CTRL_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_TB12_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_TB12_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_CTRL_TB12_SEL_OFF (2u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_CTRL_ARU_EN_OFF (3u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_LEN (5u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ACB */
#define IFX_GTM_ATOM_CH_CTRL_ACB_OFF (4u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_CTRL_CMP_CTRL_OFF (9u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.EUPM */
#define IFX_GTM_ATOM_CH_CTRL_EUPM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.EUPM */
#define IFX_GTM_ATOM_CH_CTRL_EUPM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.EUPM */
#define IFX_GTM_ATOM_CH_CTRL_EUPM_OFF (10u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.SL */
#define IFX_GTM_ATOM_CH_CTRL_SL_OFF (11u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_SR_LEN (3u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_SR_MSK (0x7u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_CTRL_CLK_SRC_SR_OFF (12u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_ECLK_SRC_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_ECLK_SRC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_CTRL_ECLK_SRC_OFF (15u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_CTRL_WR_REQ_OFF (16u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_CTRL_TRIG_PULSE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_CTRL_TRIG_PULSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_CTRL_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_CTRL_TRIG_PULSE_OFF (17u)

/** \brief Length for Ifx_GTM_ATOM_CH_CTRL_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_CTRL_UDMODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CTRL_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_CTRL_UDMODE_MSK (0x3u)

