xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_SOMB_WR_REQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_SOMB_WR_REQ_OFF (16u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMB_EXTTRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMB_EXTTRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMB_EXTTRIGOUT_OFF (23u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMB_TRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMB_TRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMB_TRIGOUT_OFF (24u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.ABM */
#define IFX_GTM_ATOM_CH_SOMB_ABM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.ABM */
#define IFX_GTM_ATOM_CH_SOMB_ABM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.ABM */
#define IFX_GTM_ATOM_CH_SOMB_ABM_OFF (27u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.SOMB */
#define IFX_GTM_ATOM_CH_SOMB_SOMB_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.SOMB */
#define IFX_GTM_ATOM_CH_SOMB_SOMB_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.SOMB */
#define IFX_GTM_ATOM_CH_SOMB_SOMB_OFF (30u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMB_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMB_FREEZE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMB_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMB_FREEZE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMB_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMB_FREEZE_OFF (31u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMC_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMC_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMC_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_SOMC_TB12_SEL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_SOMC_TB12_SEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.TB12_SEL */
#define IFX_GTM_ATOM_CH_SOMC_TB12_SEL_OFF (2u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMC_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMC_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMC_ARU_EN_OFF (3u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.ACB_1_0 */
#define IFX_GTM_ATOM_CH_SOMC_ACB_1_0_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.ACB_1_0 */
#define IFX_GTM_ATOM_CH_SOMC_ACB_1_0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.ACB_1_0 */
#define IFX_GTM_ATOM_CH_SOMC_ACB_1_0_OFF (4u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.ACB_4_3_2 */
#define IFX_GTM_ATOM_CH_SOMC_ACB_4_3_2_LEN (3u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.ACB_4_3_2 */
#define IFX_GTM_ATOM_CH_SOMC_ACB_4_3_2_MSK (0x7u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.ACB_4_3_2 */
#define IFX_GTM_ATOM_CH_SOMC_ACB_4_3_2_OFF (6u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_SOMC_CMP_CTRL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_SOMC_CMP_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.CMP_CTRL */
#define IFX_GTM_ATOM_CH_SOMC_CMP_CTRL_OFF (9u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.EUPM */
#define IFX_GTM_ATOM_CH_SOMC_EUPM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.EUPM */
#define IFX_GTM_ATOM_CH_SOMC_EUPM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.EUPM */
#define IFX_GTM_ATOM_CH_SOMC_EUPM_OFF (10u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMC_SL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMC_SL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMC_SL_OFF (11u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_SOMC_WR_REQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_SOMC_WR_REQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.WR_REQ */
#define IFX_GTM_ATOM_CH_SOMC_WR_REQ_OFF (16u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMC_EXTTRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMC_EXTTRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMC_EXTTRIGOUT_OFF (23u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMC_TRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMC_TRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMC_TRIGOUT_OFF (24u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_SOMC_SLA_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_SOMC_SLA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.SLA */
#define IFX_GTM_ATOM_CH_SOMC_SLA_OFF (25u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_SOMC_ABM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_SOMC_ABM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.ABM */
#define IFX_GTM_ATOM_CH_SOMC_ABM_OFF (27u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMC_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMC_FREEZE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMC_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMC_FREEZE_MSK (0x1u)

